from string import Template 

### RAG Template ###

### System ###

system_prompt = Template("\n".join([
    "أنت مساعد هدفك هو إنشاء رد للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة باستفسار المستخدم.",
    "يجب عليك إنشاء الرد بناءً فقط على المستندات المقدمة.",
    "تجاهل أي مستندات غير ذات صلة باستفسار المستخدم.",
    "يجب أن يكون الرد بنفس لغة استفسار المستخدم.",
    "كن مهذبًا ومحترمًا في ردك.",
    "كن دقيقًا ومختصرًا، وتجنب المعلومات غير الضرورية.",    
]))


### Document ###
document_prompt = Template(
    "\n".join([
        "## رقم المستند: $doc_num",
        "### المحتوى: $chunk_text",
]))

### Footer ###
footer_prompt = Template(
    "\n".join([
        "اعتمادًا فقط على المستندات أعلاه، يرجى إنشاء إجابة للمستخدم.",
        "## السؤال:",
        "$query",
        "",
        "## الإجابة:",
    ])
)